{"class_name": "Functional", "config": {"name": "model_14", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 224], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_15"}, "registered_name": null, "name": "input_15", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_14", "trainable": true, "dtype": "float32", "num_heads": 2, "key_dim": 7, "value_dim": 7, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 4, 224], "key_shape": [null, 4, 224], "value_shape": [null, 4, 224]}, "registered_name": null, "build_config": {"input_shape": [null, 4, 224]}, "name": "multi_head_attention_14", "inbound_nodes": [[["input_15", 0, 0, {"key": ["input_15", 0, 0], "value": ["input_15", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_29", "trainable": true, "dtype": "float32", "rate": 0.5806299238455527, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 224]}, "name": "dropout_29", "inbound_nodes": [[["multi_head_attention_14", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_18", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 4, 224]}, "name": "flatten_18", "inbound_nodes": [[["dropout_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 896]}, "name": "dense_25", "inbound_nodes": [[["flatten_18", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["dense_25", 0, 0]]}, "keras_version": "2.14.0", "backend": "tensorflow"}